public class ReportsCheck {


}

/* При вызове сверки данных программа должна:
Подсчитывать две суммы: общие доходы и общие расходы по каждому из месяцев.

Сверять полученные суммы с суммой доходов и расходов в отчёте по году.

Если обнаружена ошибка, программа должна выводить месяц, в котором обнаружено несоответствие.

Если ошибок не обнаружено, должна выводиться только информация об успешном завершении операции.

Перед сверкой не забудьте проверить, что пользователь уже вызвал методы по считыванию обоих видов отчётов.
Для этого можно проверить значение отчётов на null, либо завести дополнительную приватную boolean переменную.
 */